## Pandas ``read_sql``

Para no realizar la conexion manualmente se hará con SQLAlchemy

https://docs.sqlalchemy.org/en/20/

Desde sqlAlchemy importamos create_engine, que es lo que nos va a permitir crear la conexión a la DB

Instalo pymysql

In [27]:
pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
print('sqlalchemy version', sqlalchemy.__version__)

sqlalchemy version 2.0.34

Creo un string conexion con los datos de la db,  
y un engine con la conexion.
Directamente con pandas puedo sacar los datos a un dataframe

In [3]:
con_string = 'mysql+pymysql://root:college@localhost/employees'
engine = create_engine(con_string)

query = """
    SELECT *
    FROM employees e
    JOIN salaries s
    ON e.emp_no = s.emp_no
    WHERE e.hire_date > '1999-01-01';
"""
# creo un dataframe al que le paso el lector pandas con el query a ejecutar y el engine
df_read_sql = pd.read_sql(query, engine)

In [5]:
df_read_sql

,emp_no,birth_date,first_name,last_name,gender,hire_date,emp_no,salary,from_date,to_date
0,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,10019,44276,1999-04-30,2000-04-29
1,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,10019,46946,2000-04-29,2001-04-29
2,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,10019,46775,2001-04-29,2002-04-29
3,10019,1953-01-23,Lillian,Haddadi,M,1999-04-30,10019,50032,2002-04-29,9999-01-01
4,10105,1962-02-05,Hironoby,Piveteau,M,1999-03-23,10105,59258,1999-05-17,2000-05-16
...,...,...,...,...,...,...,...,...,...,...
4848,499610,1962-12-28,Kiyokazu,Vernadat,F,1999-08-29,499610,88013,2001-08-28,9999-01-01
4849,499888,1959-05-30,Hilari,Smeets,M,1999-06-27,499888,40000,1999-06-27,2000-06-26
4850,499888,1959-05-30,Hilari,Smeets,M,1999-06-27,499888,41159,2000-06-26,2001-06-26
4851,499888,1959-05-30,Hilari,Smeets,M,1999-06-27,499888,41709,2001-06-26,2002-06-26
4852,499888,1959-05-30,Hilari,Smeets,M,1999-06-27,499888,45235,2002-06-26,9999-01-01